Catalogs/АР_СпискиСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_СпискиСчетчиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСчетчиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентОтнесенияСчетчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_СпискиСчетчиков/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	Параметры.Свойство("Услуга", Услуга);
	Параметры.Свойство("ОбъектАренды", ОбъектАренды);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_СпискиСчетчиков.ФормаОбъекта", ПараметрыФормы);
		ФормаГрафика.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ФормаСчетчика = ПолучитьФорму("Справочник.АР_СпискиСчетчиков.ФормаОбъекта", ПараметрыФормы, Элемент);
	ФормаСчетчика.Объект.Владелец = АР_ОбщиеПроцедуры.ЗначениеРеквизитаОбъекта(ДокументВладелец, "ДоговорКонтрагента");
	ФормаСчетчика.Объект.Документ = ДокументВладелец;
	ФормаСчетчика.Объект.Наименование = "Счетчики по услуге """ + Услуга + """ и объекту """ + ОбъектАренды + """";
	
	Если Копирование Тогда
		ПолучитьСписокСчетчиковНаСервере(ТекущиеДанные.Ссылка);
		Для Каждого Строк Из СписокСчетчиков Цикл
			Стр = ФормаСчетчика.Объект.СписокСчетчиков.Добавить();
			Стр.Счетчик = Строк.Счетчик;
			Стр.КоэффициентОтнесенияСчетчика = Строк.КоэффициентОтнесенияСчетчика;
		КонецЦикла;
	КонецЕсли;
	
	ФормаСчетчика.ЗакрыватьПриВыборе = Ложь;
	ФормаСчетчика.Открыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСписокСчетчиковНаСервере(Ссылка)
	
	СписокСчетчиков.Очистить();
	Для Каждого Строк Из Ссылка.СписокСчетчиков Цикл
		Стр = СписокСчетчиков.Добавить();
		Стр.Счетчик = Строк.Счетчик;
		Стр.КоэффициентОтнесенияСчетчика = Строк.КоэффициентОтнесенияСчетчика;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
